public class TaskB {
    public static void main(String[] args) {

        /*  Задача Б. Ответьте на вопросы

 · Что такое git?

 Git — это система, которая позволяет сразу нескольким разработчикам сохранять и отслеживать изменения в файлах вашего проекта.

 · Для чего нужны системы контроля версий?

 Система контроля версий — это система, записывающая изменения в файл или набор файлов в течение времени и позволяющая вернуться позже к определённой версии.

 · В чем разница между удаленным и локальным репозиториями?

 Удаленный репозиторий - это репозиторий, который хранится в облаке, на сторонних сервисах, специально созданных под работу с проектами git.

 Локальный репозиторий - это репозиторий, который хранится на нашей машине, в рабочей папке проекта.

 · Что делает команда commit?

 Команда git commit делает для проекта отчет текущего состояния изменений, добавленных в раздел проиндексированных файлов. Такие подтвержденные отчеты можно рассматривать как «безопасные» версии проекта.

 · Что делает команда push?

 Команда git push используется для выгрузки содержимого локального репозитория в удаленный репозиторий. Она позволяет передать коммиты из локального репозитория в удаленный.

 · Для чего нужны ветки?

 Ветки нужны для того, чтобы программисты могли вести совместную работу над проектом и не мешать друг другу при этом.
         */

    }
}
